def solution(letter):
    morse = {
        '.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
        '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
        '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
        '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
        '-.--':'y','--..':'z'
    }
    #스플릿은 문자열을 뛰어쓰기를 기준으로 할수있다.
    return ''.join([morse[i] for i in letter.split(' ')])

# 디렉션 이용
def solution(rsp):
    d={"2":"0","0":"5","5":"2"}
    return ''.join([d[i] for i in rsp])